# Задача 9: Очистка адресов
# Приведение адресов объектов к стандартному формату

# --- Исходные адреса ---
addresses = [
    " г. Москва, ул. Ленина, д. 10 ",
    "г.Казань,ул.Баумана,д.15",
    " г. Санкт-Петербург, ул. Невский, д. 100 "
]
print("=== ОЧИСТКА АДРЕСОВ ===")
print("Исходные адреса:")
for i, addr in enumerate(addresses, 1):
    print(f"  #{i}: '{addr}'")
    # --- Очистка адресов ---
cleaned = []
for addr in addresses:
    # Убираем лишние пробелы по краям
    addr = addr.strip()
    # Добавляем пробел после сокращений г., ул., д.
    addr = addr.replace("г.", "г. ").replace("ул.", "ул. ").replace("д.", "д. ")
    # Убираем лишние пробелы внутри
    while "  " in addr:
        addr = addr.replace("  ", " ")
    # Добавляем пробел после запятой если его нет
    addr = addr.replace(",", ", ").replace(",  ", ", ")
    cleaned.append(addr)