# Задача 8: Анализ заказов
# Использование множеств для анализа материалов трёх подрядчиков

# --- Списки материалов трёх подрядчиков ---
contractor1 = {"Кирпич", "Цемент", "Песок", "Арматура", "Бетон"}
contractor2 = {"Цемент", "Бетон", "Гипс", "Краска", "Плитка"}
contractor3 = {"Песок", "Бетон", "Утеплитель", "Брус", "Цемент"}

print("=== АНАЛИЗ ЗАКАЗОВ ПОДРЯДЧИКОВ ===")
print(f"Подрядчик 1: {contractor1}")
print(f"Подрядчик 2: {contractor2}")
print(f"Подрядчик 3: {contractor3}")